# SSD with Mobilenet v2 configuration for OpenImages V4 Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.

model {
  ssd {
    num_classes: 2 # SET HOW MANY CLASSES YOU HAVE
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 240
        width: 320
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'  # Set to the name of your chosen pre-trained model
      min_depth: 16
      depth_multiplier: 1
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        weighted_sigmoid {
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-5
        iou_threshold: 0.5
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 24 # Increase/Decrease this value depending on the available memory (Higher values require more memory and vice-versa)
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.0001
          decay_steps: 100
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  gradient_clipping_by_norm: 10.0
  keep_checkpoint_every_n_hours: 24
  fine_tune_checkpoint: "PATH_TO_BE_CONFIGURED/model.ckpt" # Path to extracted files of pre-trained model     ### MODIFY HERE ###
  fine_tune_checkpoint_type:  "detection" # FIXES ERROR: "ValueError: No variables to save"
  from_detection_checkpoint: true # FIXES ERROR: "ValueError: No variables to save" # UPDATE: Doesn't work
  load_all_detection_checkpoint_vars: true
  #freeze_variables: ".FeatureExtractor."
  num_steps: 4500
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  data_augmentation_options {
    random_rgb_to_gray {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
}

train_input_reader: {




  tf_record_input_reader {
	input_path:"PATH_TO_BE_CONFIGURED"# Path to training TFRecord file        ### MODIFY HERE ###
    #input_path: "./labelimg/dataset/data/finetuning-2-train.record" 
  }
  label_map_path: "./configs/oid_v4_label_map_bottle_and_tin_can.pbtxt" # Path to label map file               ### MODIFY HERE ###
}

eval_config: {
  # metrics_set: "oid_V2_detection_metrics"
  metrics_set: "coco_detection_metrics"
}

eval_input_reader: {
  sample_1_of_n_examples: 10
  tf_record_input_reader {
    input_path:"PATH_TO_BE_CONFIGURED"# Path to testing TFRecord file        ### MODIFY HERE ###
    # input_path: "../dataset/open_images_v4_dataset/validation.tfrecord" # Path to testing TFRecord file               ### MODIFY HERE ###
    # input_path: "../dataset/open_images_v4_dataset/test.tfrecord" # Path to testing TFRecord file                   ### MODIFY HERE ###
    # input_path: "../dataset/open_images_v4_dataset/mytestset_test.record" # Path to my_dataset tfrecord file        ### MODIFY HERE ###
  }
  label_map_path: "./configs/oid_v4_label_map_bottle_and_tin_can.pbtxt" # Path to label map file                          ### MODIFY HERE ###
  shuffle: false
  num_readers: 1
}


}
